package com.tvoyagryvnia.util;

public class Messages {

    public static String REGISTRATION_SUBJECT = "Інформація про реєстрацію на tvoyagrivnya!";
    public static String REGISTRATION_BODY = "Привіт %s ,<br>Дякуємо за реєстрацію в нашій системі<br> " +
            "Твій пароль: %s <br>" +
            "Ти маєш можливість змінити його в панелі керування.";
    public static String FEEDBACK_SUBJECT = "Зворотній звя`язок tvoyagrivnya";
    public static String FEEDBACK_BODY = "Привіт %s ,<br>Дякуємо за вашу думку<br> " +
            "Очікуйте відповідь найблищим часом, з повагою адміністрація tvoyagrivnya.";

    public static String CONTROL_MEMBERS_ADDITION_ROLE = "Повноваження надає можливість переглядати загальну статистику членів сімї";
    public static String EMAIL_IS_USER_ALREADY = "Пошта вже використовується, спробуйте іншу.";

    public static String INVITE_SUBJECT = "Запрошення до  tvoyagrivnya!";
    public static String INVITATION_BODY = "Привіт %s ,<br>%s запросив вас до системи управління сімейним бюджетом<br> " +
            "Твій логін: %s , твій пароль: %s<br>" +
            "Ти маєш можливість змінити його в панелі керування.";

    public static String PASSWORD_CHANGE_SUBJECT = "Зміна паролю до акаунту tvoyagrivnya!";
    public static String PASSWORD_CHANGE__BODY = "Ваш пароль було змінено, новий пароль: %s";


    public static String HELP_COMMANDS_SUBJECT = "Інформація про використання команд";
    public static String HELP_COMMANDS_BODY = "<html>\n" +
            "<body>\n" +
            "<p align=center\">\n" +
            "\tКоманди які працюють в нашій системі\n" +
            "</p>\n" +
            "\n" +
            "\t<b>звіт</b> - команда, яка дозволяє откримати звіт про витрати та прибуток<br>\n" +
            "\tСтруктура команди report -параметр значення -параметр значення<br>\n" +
            "\tпараметри та їх можливі значення<br>\n" +
            "\tПараметр <b>-показати</b> значення все|прибуток|витрати <br>\n" +
            "\tвсе - отримати витрати та прибуток, прибуток - тільки прибуток, витрати - витрати.<br>\n" +
            "\tПараметр <b>-період</b> задає період за який потрібно отримати звітність<br>\n" +
            "\tсьогодні|місяць|рік|22.12.2015|01.02.2015-08.02.2015 - види періодів<br>\n" +
            "\tПриклад команд<br>\n" +
            "\t<b>звіт -показати все -період сьогодні</b> - Показати витрати та прибуток за сьогодні<br>\n" +
            "\t<b>звіт -показати прибуток -період 01.02.2015-04.02.2015</b> - Показати прибуток за період 01.02.2015-04.02.2015<br>\n" +
            "\t<b>звіт -показати прибуток -період 01.02.2015</b> - Показати прибуток за період 01.02.2015<br>\n" +
            "\t<br><br>\n" +
            "\t<b>рахунок</b> - команда, яка дозволяє переглянути інформацію по рахунках.<br>\n" +
            "\tСтруктура команди account -параметр значення<br>\n" +
            "\tПараметр <b>-показати</b> значення все|номер рахунка <br>\n" +
            "\tПриклад команд<br>\n" +
            "\t<b>рахунок -показати все</b> - Показати інформацію про всі рахунки<br>\n" +
            "\t<b>рахунок -показати 2</b> - Показати інформацію про рахунок з номером 2<br>\n" +
            "</body>\n" +
            "</html>";
}
